#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)//无效的循环写法，会陷入死循环
//	{
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//	return 0;
//}
int main()
{
	int i = -20;
//	i = -20
//	  = 1000 0000|0000 0000|0000 0000|0001 0100（原码）
//	  = 1111 1111|1111 1111|1111 1111|1110 1011（反码）
//	  = 1111 1111|1111 1111|1111 1111|1110 1100（补码）
	unsigned int j = 10;
//	j = 10
//	  = 0000 0000|0000 0000|0000 0000|0000 1010（原码/反码/补码）

	printf("%d\n", i + j);//数据计算本质，内存中的二进制序列进行计算
	//1111 1111|1111 1111|1111 1111|1110 1100（补码）
	//0000 0000|0000 0000|0000 0000|0000 1010（原码/反码/补码）
	//										+
	//----------------------------------------
	//1111 1111|1111 1111|1111 1111|1111 0110
	//根据%d，则解释为signed int，由上面的二进制序列，得出结果为-10

	printf("%u\n", i + j);
	//根据%u，则解释为unsigned int，由上面的二进制序列，得出结果为4294967286
	return 0;
}