#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
#include<windows.h>
#define line_number 8//行数
#define column_number 8//列数
//国际象棋函数
void chess_1()//1、首先将控制台的输出字体也改为“点阵字体Sans Serif”优化视觉效果
{
	int i = 0;//2、设定一个行数
	int j = 0;//3、设置一个列数
	SetConsoleOutputCP(437);//4、暂时改字符集为“MS-DOS美语/英语”
	for (i = 0; i < line_number; i++)
	{
		for (j = 0; j < column_number; j++)
		{
			if ((i + j) % 2 == 0)//5、给每个格子设定坐标，符合条件i+j为偶数的（i，j）应该打印成白色格子
			{
				printf("%c%c", 219, 219);//6、“219”是在“MS-DOS美语/英语”编码下的白色格子,但是这个白色矩形图案“█”在输出的时候只有一半，视觉效果不好，所以输出两个白色格子
			}
			else
			{
				printf("  ");//7、如果i+j为奇数，打印空白，背景颜色就是黑色，充当黑色格子
			}
		}
		printf("\n");//8、打印结束后空一格
	}
	SetConsoleOutputCP(936);//9、恢复“简体中文”字符集，避免后面的字符变成乱码
}

//中国象棋函数
void chess_2()
{
	int i, j;
	int arr[19][18] =//10、创建一个数组
	{
		{'a',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'c',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'e',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'g',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'i',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,' ',' ','A',' ','B',' ',' ',' ',' ',' ','C',' ','D',' ',' ',1},
		{'k',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'m',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'o',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'q',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
		{'b',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{'b',0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0} 
	};
	for (i = 0; i < 19; i++)//11、从行开始
	{
		for (j = 0; j < 18; j++)//12、依照本行，一列一列的表示每一个数组元素，并在后续通过两个switch语句，对每一个数组元素的值进行判断，然后对应打印字符
		{
			if (arr[i][j] == 0 || arr[i][j] == 1)//13、数组元素值为1或0的情况下
			{
				switch (arr[i][j]) 
				{
				case 0://14、如果这里的数组元素值为0
					if (i == 0 && j == 1) 
					{ 
						printf("╔ ");//15、打印左上角
						break; 
					}
					else if (i == 0 && j == 17) 
					{ 
						printf("╗"); //16、打印右上角
						break; 
					}
					else if (i == 18 && j == 1) 
					{ 
						printf("╚ ");//17、打印右下角
						break; 
					}
					else if (i == 18 && j == 17) 
					{ 
						printf("╝"); //18、打印左下角
						break; 
					}
					else if (i == 2 && j == 9 || i == 16 && j == 9)//19、在数组第2行第9列，第16行第9列，并且数组元素为0的地方，打印“士”的路线
					{
						printf("╳ ");
						break;
					}
					else if (i != 0 && j == 1 || i != 18 && j == 1) //20、数组的第1列，，并且数组元素为0的地方，间隔打印符号╟
					{ 
						printf("╟ "); 
						break; 
					}
					else if (i != 0 && j == 17 || i != 18 && j == 17) //22、数组的第17列，，并且数组元素为0的地方，间隔打印符号╢
					{ 
						printf("╢"); 
						break; 
					}
					else if (i == 0 && j != 1 || i == 10 && j != 1)//23、在数组的第0行，第10行，并且数组元素为0的地方，打印╤
					{ 
						printf("╤ "); 
						break; 
					}
					else if (i == 8 && j != 17|| i == 18 && j != 1) //24、数组的第18行，第8行，并且数组元素为0的地方，打印╧
					{ 
						printf("╧ "); 
						break;
					}
					else//25、其他标记元素为0的地方都打印为┼
					{ 
						printf("┼ ");
						break; 
					}
					////////////////////////////////////////////////////////////////////////////////////////////////
				case 1:
					if (i == 0 || i == 18) 
					{ 
						printf("═ "); //26、打印0行和18行剩下所有的“双横线”
						break; 
					}
					else if (j == 1)//27、打印1列所有的“双竖线”
					{
						printf("║"); 
						break; 
					}
					else if (j == 17) //28、打印17列所有的竖线“双竖线
					{ 
						printf(" ║"); 
						break;
					}
					else if ((j == 3 || j == 5 || j == 7 || j == 9 || j == 11 || j == 13 || j == 15)&&(i != 0 && i != 18))//29、打印所有的单竖线，并且i不是第0第18行
					{
							printf(" │"); 
							break;
					}
					else if ((i == 8 || i == 10||i == 2 || i == 4 || i == 6 || i == 12 || i == 14 || i == 16)&&((j != 1 && j != 17)))//30、打印单横线，并且j不是第1、17列
					{
							printf("──");
							break; 
					}
					else//31、剩下的都是空格！！！
					{ 
						printf("  "); //32、两个空格更加美观
						break; 
					}
				}
			}
			else
			{
				switch (arr[i][j]) 
				{
				case 'a':
					printf("10 "); 
					break;
				case 'b':
					printf("   ");//33、每个数字之间的空格 
					break;
				case 'c':
					printf("9  ");
					break;
				case 'e':
					printf("8  "); 
					break;
				case 'g':
					printf("7  "); 
					break;
				case 'i':
					printf("6  ");  
					break;
				case 'k':
					printf("5  "); 
					break;
				case 'm':
					printf("4  "); 
					break;
				case 'o':
					printf("3  "); 
					break;
				case 'q':
					printf("2  "); 
					break;
				case 'C':
					printf("楚");
					break;
				case 'D':
					printf("河");
					break;
				case 'A':
					printf("汉");
					break;
				case 'B':
					printf("界");
					break;
				case ' ':
					printf("  ");
					break;
				}
			}
		}
		printf("\n");//34、内循环换行
	}
	printf("\n1      2   3   4   5   6   7   8   9\n");//35、棋盘下标
}

//36、界面函数
void ui()
{
	printf("\t棋盘显示程序运行中……\n\n");
	printf//打印用户界面，其中可以在printf中利用多个""来换行，写不同的内容，便于观看代码
	(
		"***************************************\n"
		"***************************************\n"
		"** 1、国际象棋 ********* 2、中国象棋 **\n"
		"***************************************\n"
		"***************************************\n"
		"** 3、退出程序 ********* 4、小组信息 **\n"
		"***************************************\n"
		"***************************************\n"
	);
	printf("\n请输入您的选择（例如输入1打印出国际棋盘）：");
}

//37、小组信息函数
void group()
{
	char* a[3] = {"方俊杰","李辉彬","李家鹏"};
	printf("我们小组的成员有：\n");
	for (int i = 0; i < 3; i++)
	{
		printf("%d、%s\n", i+1, a[i]);
	}
	printf("具体分工：详情看word报告……\n");
	printf("\n");

	FILE* g = fopen("D:\\VS文件夹\\（1）实验代码\\实验代码14（C语言团队合作）\\棋盘实验日志.txt", "r");//打开文件是按照ANSI来的
	char ch;
	if (g != NULL)//打开不出错的情况下（如文件不存在）
	{
		ch = fgetc(g);//读取文件一个字符
		while (ch != EOF)//文件不到末尾
		{
			printf("%c", ch);
			ch = fgetc(g);
		}
		fclose(g);//关闭文件
		printf("\n");
	}

}

//38、main()主体运行函数
int main()
{
	int i = 0;
	ui();//使用界面函数
	while (1 == scanf("%d", &i))//成功输入一个选择
	{
		if (1 == i)//选择国际象棋
		{
			printf("\n");
			chess_1();
			ui();
		}
		else if (2 == i)//选择中国象棋
		{
			printf("\n");
			chess_2();
			ui();
		}
		else if (3 == i)//选择退出程序
		{
			printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");//不会控制台的函数，充当清屏函数hhhhhh
			printf("您已经退出\n");
			break;
		}
		else if (4 == i)//查看小组信息
		{
			printf("\n");
			group();
			ui();
		}
		else
		{
			printf("\a输入错误，请再次输入选择（1~4）");//提示错误，并且响铃提示
		}
	}
	return 0;
}
//后续补充：
//①其实可以设置多的自定义头文件，但是有点累了，不想写了
//②可以运用一些指针的这里，比如开头那个数组
//③开头那个数组感觉有点捞，就是不知道easy库可不可以用逻辑坐标实现，或许更加的美观（比如国际象棋直接用最简单的矩形函数然后上色就行）
//④如何用美化其他的界面也是问题……如何打包整个文件呢？