#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
//实验4 选择结构程序设计（一）
//实验目的
//（1）了解C语言表示逻辑量的方法
//（2）正确使用逻辑运算符和逻辑表达式
//（3）熟练掌握if语句和switch语句
//（4）结合程序掌握一些简单的算法
//（5）学习调试程序

//任务一：单分支if语句
//int main()
//{
//	unsigned int number;
//	int result;
//	printf("输入一个无符号整数：\n");
//	scanf("%d", &number);
//	result = number % 2;
//	if (result == 0)
//		printf("%d为偶数\n", number);
//	if (result == 1)
//		printf("%d为奇数\n", number);
//	return 0;
//}
//任务二：双分支if-else
//int main()
//{
//	unsigned int number;
//	int result;
//	printf("输入一个无符号整数：\n");
//	scanf("%d", &number);
//	result = number % 2;
//	if (result == 0)
//	{
//		printf("%d为偶数\n", number);
//	}
//	else
//	{
//		printf("%d为奇数\n", number);
//	}
//	return 0;
//}
//任务三：数值特点判断
//int main()
//{
//	int x = 0;
//	//1.输入x的值
//	printf("请输入一个整数：");
//	scanf("%d", &x);
//	//2、二值判断：x是负数
//	if (x < 0)
//	{
//		printf("x（%d）是负数？是\n",x);
//	}
//	else
//	{
//		printf("x（%d）是负数？否\n",x);
//	}
//	//3、二值判断：x小于等于100
//	if (x <= 100)
//	{
//		printf("x（%d）小于等于100？是\n",x);
//	}
//	else
//	{
//		printf("x（%d）小于等于100？否\n",x);
//	}
//	//4、范围判断：x在-10和-20之间
//	if ((x >= -20) && (x <= -10))
//	{
//		printf("x（%d）在-10和-20之间？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）在-10和-20之间？否\n", x);
//	}
//	//5、范围判断：x在0和100之间
//	if ((x >= 0) && (x <= 100))
//	{
//		printf("x（%d）在0和100之间？是\n",x);
//	}
//	else
//	{
//		printf("x（%d）在0和100之间？否\n",x);
//	}
//	//6、范围判断：x大于100或者x小于10
//	if ((x >= 100) || (x < 10))
//	{
//		printf("x（%d）大于100或者小于10？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）大于100或者小于10？否\n", x);
//	}
//	//7、数值判断：x是偶数
//	//8、数值判断：x是奇数
//	int result;
//	result = x % 2;
//	if (result == 0)
//	{
//		printf("x（%d）是偶数？真\n", x);
//		printf("x（%d）是奇数？否\n", x);
//	}
//	else
//	{
//		printf("x（%d）是偶数？否\n", x);
//		printf("x（%d）是奇数？真\n", x);
//	}
//	//9、数值判断：x是5的倍数
//	if (x % 5 == 0)
//	{
//		printf("x（%d）是5的倍数？是\n",x);
//	}
//	else
//	{
//		printf("x（%d）是5的倍数？否\n");
//	}
//	//10、组合判断：x大于20并且是3的倍数
//	if ((x > 20) && (x % 3 == 0))
//	{
//		printf("x（%d）大于20并且是3的倍数？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）大于20并且是3的倍数？否\n", x);
//	}
//	//11、组合判断：x能被3整除或者能被5整除
//	if ((x % 3 == 0) || (x % 5 == 0))
//	{
//		printf("x（%d）能被3整除或者能被5整除？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）能被3整除或者能被5整除？否\n", x);
//	}
//	//12、组合判断：x能被5整除但不能被3整除
//	if ((x % 3 != 0) || (x % 5 == 0))
//	{
//		printf("x（%d）能被5整除但不能被3整除？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）能被5整除但不能被3整除？否\n", x);
//	}
//	//13、组合判断：x能被5整除且能被3整除
//	if ((x % 5 == 0))
//	{
//		if ((x % 3) == 0)
//		{
//			printf("x（%d）能被5整除且能被3整除？是\n", x);
//		}
//		else
//		{
//			printf("x（%d）能被5整除且能被3整除？否\n", x);
//		}
//	}
//	else
//	{
//		printf("x（%d）能被5整除但不能被3整除？否\n", x);
//	}
//	//14、组合判断：x是0~100之间的整数，并且能被3和5整除
//	if ((x >= 0 && x <= 100) && ((x % 3 == 0) && (x % 5 == 0)))
//	{
//		printf("x（%d）是0~100之间的整数，并且能被3和5整除？是\n", x);
//	}
//	else
//	{
//		printf("x（%d）是0~100之间的整数，并且能被3和5整除？否\n", x);
//	}
//	//15、组合判断：x不是0~100之间的整数，或者不是能被3整除但能被5整除的整数
//	if ((x < 0 && x > 100) || ((x % 3 != 0) && (x % 5 != 0)))
//	{
//		printf("x（%d）不是0~100之间的整数，或者不是能被3整除且能被5整除的整数？否\n", x);
//	}
//	else
//	{
//		printf("x（%d）不是0~100之间的整数，或者不是能被3整除且能被5整除的整数？是\n", x);
//	}
//	printf("\n哈哈，我真棒！！！\n\n");
//	return 0;
//}

		
	
	
